<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.may-den.jss.brave</string>
    <key>Input</key>
      <dict>
        <key>CATEGORY</key>
        <string>Productivity</string>
        <key>GROUP_NAME</key>
        <string>[Smart] Software: %NAME%</string>
        <key>GROUP_TEMPLATE</key>
        <string>SmartGroupTemplate.xml</string>
        <key>NAME</key>
        <string>Brave</string>
        <key>OS_REQUIREMENTS</key>
        <string>10.15.x,10.14.x,10.13.x</string>
        <key>POLICY_CATEGORY</key>
        <string>Productivity</string>
        <key>POLICY_TEMPLATE</key>
        <string>PolicyTemplate.xml</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string>The new Brave browser blocks ads and trackers that slow you down and invade your privacy. Discover a new way of thinking about how the web can work.</string>
        <key>SELF_SERVICE_ICON</key>
        <string>brave_browser.png</string>
      </dict>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.download.brave</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
  	<array>
  		<dict>
  			<key>Arguments</key>
  			<dict>
  				<key>category</key>
  				<string>%CATEGORY%</string>
  				<key>groups</key>
  				<array>
  					<dict>
  						<key>name</key>
  						<string>%GROUP_NAME%</string>
  						<key>smart</key>
  						<true/>
  						<key>template_path</key>
  						<string>%GROUP_TEMPLATE%</string>
  					</dict>
  				</array>
  				<key>os_requirements</key>
  				<string>%OS_REQUIREMENTS%</string>
  				<key>policy_category</key>
  				<string>%POLICY_CATEGORY%</string>
  				<key>policy_template</key>
  				<string>%POLICY_TEMPLATE%</string>
  				<key>prod_name</key>
  				<string>%NAME%</string>
  				<key>self_service_description</key>
  				<string>%SELF_SERVICE_DESCRIPTION%</string>
  				<key>self_service_icon</key>
  				<string>%SELF_SERVICE_ICON%</string>
  			</dict>
  			<key>Processor</key>
  			<string>JSSImporter</string>
  		</dict>
  	</array>
</dict>
</plist>
